#pragma once
#include "Mof.h"
#include "Controll.h"

namespace ToolControll
{
	// ********************************************************************************
	/// <summary>
	/// ボタンクラス
	/// </summary>
	// ********************************************************************************
	class CButton : public CControll
	{
	public:
		enum BtnIconAlignment {
			ICON_LEFT,					//!<左
			ICON_RIGHT,					//!<右
		};
	private:
		MofU32    m_BackColorOver;		//!<背景色(マウスオーバー時)
		MofU32    m_LineColorOver;		//!<枠線の色(マウスオーバー時)

		MofU32    m_PushBackColor;		//!<押している間の背景色
		MofU32	  m_PushLineColor;		//!<押している間の枠の色

		LPTexture m_pTexture;			//!<ボタン内アイコン用画像
		int		  m_IconAlign;			//!<アイコンの書式

	public:
		// ********************************************************************************
		/// <summary>
		/// コンストラクタ
		/// </summary>
		/// <created>いのうえ,2020/02/24</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		CButton(void);
		// ********************************************************************************
		/// <summary>
		/// デストラクタ
		/// </summary>
		/// <created>いのうえ,2020/02/24</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		~CButton(void);
		// ********************************************************************************
		/// <summary>
		/// ボタン生成
		/// </summary>
		/// <returns>ボタンのポインタ</returns>
		/// <created>いのうえ,2020/02/24</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		static std::shared_ptr<CButton> CreateButton(void);
		// ********************************************************************************
		/// <summary>
		/// 画像の読み込み
		/// </summary>
		/// <param name="pName">ファイル名</param>
		/// <returns>成功か失敗</returns>
		/// <created>いのうえ,2020/03/02</created>
		/// <changed>いのうえ,2020/03/02</changed>
		// ********************************************************************************
		MofBool Load(LPCMofChar pName);
		// ********************************************************************************
		/// <summary>
		/// 描画
		/// </summary>
		/// <created>いのうえ,2020/02/24</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		virtual void Render(void) override;
		// ********************************************************************************
		/// <summary>
		/// 解放
		/// </summary>
		/// <created>いのうえ,2020/03/02</created>
		/// <changed>いのうえ,2020/03/02</changed>
		// ********************************************************************************
		void Release(void);
		// ********************************************************************************
		/// <summary>
		/// 押している間の色の設定
		/// </summary>
		/// <param name="color">色</param>
		/// <created>いのうえ,2020/02/28</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetPushBackColor(const MofU32& color);
		// ********************************************************************************
		/// <summary>
		/// 押している間の線の色の設定
		/// </summary>
		/// <param name="color">色</param>
		/// <created>いのうえ,2020/02/28</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetPushLineColor(const MofU32& color);
		// ********************************************************************************
		/// <summary>
		/// 背景色の設定(マウスオーバー時)
		/// </summary>
		/// <param name="color">色</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetBackColorOver(const MofU32& color);
		// ********************************************************************************
		/// <summary>
		/// 枠線の色の設定(マウスオーバー時)
		/// </summary>
		/// <param name="color">色</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetLineColorOver(const MofU32& color);
		// ********************************************************************************
		/// <summary>
		/// アイコンの表示位置設定
		/// </summary>
		/// <param name="ali">位置</param>
		/// <created>いのうえ,2020/03/02</created>
		/// <changed>いのうえ,2020/03/02</changed>
		// ********************************************************************************
		void SetIconAlign(const BtnIconAlignment& ali);
	};

	//置き換え
	typedef std::shared_ptr<CButton> LPButton;
}

