#pragma once
#include "Mof.h"
#include "Controll.h"

namespace ToolControll
{
	// ********************************************************************************
	/// <summary>
	/// ボタンクラス
	/// </summary>
	// ********************************************************************************
	class CButton : public CControll
	{
		MofU32  m_BackColorOver;		//!<背景色(マウスオーバー時)
		MofU32  m_LineColorOver;		//!<枠線の色(マウスオーバー時)

		MofU32  m_PushBackColor;		//!<押している間の背景色
		MofU32  m_PushLineColor;		//!<押している間の枠の色

	public:
		// ********************************************************************************
		/// <summary>
		/// コンストラクタ
		/// </summary>
		/// <created>いのうえ,2020/02/24</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		CButton(void);
		// ********************************************************************************
		/// <summary>
		/// デストラクタ
		/// </summary>
		/// <created>いのうえ,2020/02/24</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		~CButton(void);
		// ********************************************************************************
		/// <summary>
		/// ボタン生成
		/// </summary>
		/// <returns>ボタンのポインタ</returns>
		/// <created>いのうえ,2020/02/24</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		static std::shared_ptr<CButton> CreateButton(void);
		// ********************************************************************************
		/// <summary>
		/// 描画
		/// </summary>
		/// <created>いのうえ,2020/02/24</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		virtual void Render(void) override;
		// ********************************************************************************
		/// <summary>
		/// 押している間の色の設定
		/// </summary>
		/// <param name="color">色</param>
		/// <created>いのうえ,2020/02/28</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetPushBackColor(const MofU32& color);
		// ********************************************************************************
		/// <summary>
		/// 押している間の線の色の設定
		/// </summary>
		/// <param name="color">色</param>
		/// <created>いのうえ,2020/02/28</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetPushLineColor(const MofU32& color);
		// ********************************************************************************
		/// <summary>
		/// 背景色の設定(マウスオーバー時)
		/// </summary>
		/// <param name="color">色</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetBackColorOver(const MofU32& color);
		// ********************************************************************************
		/// <summary>
		/// 枠線の色の設定(マウスオーバー時)
		/// </summary>
		/// <param name="color">色</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetLineColorOver(const MofU32& color);
	};

	//置き換え
	typedef std::shared_ptr<CButton> LPButton;
}

