#pragma once
#include "Mof.h"
#include "Controll.h"

namespace ToolControll
{
	// ********************************************************************************
	/// <summary>
	/// チェックボックスクラス
	/// </summary>
	// ********************************************************************************
	class CCheckBox : public CControll
	{
	private:
		MofBool		m_bCheck;			//!<チェックフラグ
	public:
		// ********************************************************************************
		/// <summary>
		/// コンストラクタ
		/// </summary>
		/// <created>いのうえ,2020/02/25</created>
		/// <changed>いのうえ,2020/02/25</changed>
		// ********************************************************************************
		CCheckBox(void);
		// ********************************************************************************
		/// <summary>
		/// デストラクタ
		/// </summary>
		/// <created>いのうえ,2020/02/25</created>
		/// <changed>いのうえ,2020/02/25</changed>
		// ********************************************************************************
		virtual ~CCheckBox(void);
		// ********************************************************************************
		/// <summary>
		/// チェックボックス生成
		/// </summary>
		/// <param name="info">生成情報</param>
		/// <returns>チェックボックス</returns>
		/// <created>いのうえ,2020/02/25</created>
		/// <changed>いのうえ,2020/02/25</changed>
		// ********************************************************************************
		static std::shared_ptr<CCheckBox> CreateCheckBox(void);
		// ********************************************************************************
		/// <summary>
		/// 更新
		/// </summary>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void Update(void);
		// ********************************************************************************
		/// <summary>
		/// 描画
		/// </summary>
		/// <created>いのうえ,2020/02/24</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		virtual void Render(void) override;
		// ********************************************************************************
		/// <summary>
		/// チェックされているかどうか
		/// </summary>
		/// <returns>チェックフラグ</returns>
		/// <created>いのうえ,2020/02/25</created>
		/// <changed>いのうえ,2020/02/25</changed>
		// ********************************************************************************
		MofBool IsCheck(void) const;
	};

	//置き換え
	typedef std::shared_ptr<CCheckBox> LPCheckBox;
}

