#pragma once
#include	"Mof.h"

namespace ToolControll
{
	// ********************************************************************************
	/// <summary>
	/// コントロール基礎クラス
	/// </summary>
	// ********************************************************************************
	class CControll
	{
	public:
		struct CreateInfo {
			Vector2 Pos;				//!<座標
			Vector2 Size;				//!<サイズ
			CString Text;				//!<表示テキスト
		};
	protected:
		Vector2 m_Pos;					//!<座標
		Vector2 m_Size;					//!<サイズ
		MofS32  m_FontSize;				//!<フォントサイズ
		CString m_Text;					//!<テキスト
		CFont	m_Font;					//!<フォント
		MofBool	m_bLineShow;			//!<枠線表示フラグ
		MofU32  m_BackColor;			//!<背景色
		MofU32  m_LineColor;			//!<枠線の色
		MofU32  m_TextColor;			//!<テキストの表示色
		MofBool m_bShow;				//!<描画フラグ
	public:
		// ********************************************************************************
		/// <summary>
		/// コンストラクタ
		/// </summary>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		CControll(void);
		// ********************************************************************************
		/// <summary>
		/// デストラクタ
		/// </summary>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		virtual ~CControll(void);
		// ********************************************************************************
		/// <summary>
		/// 生成情報の設定
		/// </summary>
		/// <param name="info">生成情報</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		virtual void SetInfo(CreateInfo info);
		// ********************************************************************************
		/// <summary>
		/// 描画
		/// </summary>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		virtual void Render(void) = 0;
		// ********************************************************************************
		/// <summary>
		/// 座標の設定
		/// </summary>
		/// <param name="pos">座標</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetPos(const Vector2& pos);
		// ********************************************************************************
		/// <summary>
		/// 座標の設定
		/// </summary>
		/// <param name="x">X座標</param>
		/// <param name="y">Y座標</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetPos(const float& x, const float& y);
		// ********************************************************************************
		/// <summary>
		/// サイズの設定
		/// </summary>
		/// <param name="size">サイズ</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetSize(const Vector2& size);
		// ********************************************************************************
		/// <summary>
		/// サイズの設定
		/// </summary>
		/// <param name="w">横幅</param>
		/// <param name="h">高さ</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetSize(const float& w, const float& h);
		// ********************************************************************************
		/// <summary>
		/// フォントの生成
		/// </summary>
		/// <param name="s">フォントサイズ</param>
		/// <param name="pFace">字体</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void FontCreate(const MofS32 s, LPCMofChar pFace);
		// ********************************************************************************
		/// <summary>
		/// テキストの設定
		/// </summary>
		/// <param name="pText">テキスト</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetText(CString text);
		// ********************************************************************************
		/// <summary>
		/// フォントサイズの設定
		/// </summary>
		/// <param name="s">サイズ</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetFontSize(const MofS32 s);
		// ********************************************************************************
		/// <summary>
		/// 枠線表示フラグの設定
		/// </summary>
		/// <param name="b">フラグ</param>
		/// <created>いのうえ,2020/02/28</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetLineShow(const MofBool& b);
		// ********************************************************************************
		/// <summary>
		/// 描画フラグの設定
		/// </summary>
		/// <param name="b">フラグ</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetShow(const MofBool& b);
		// ********************************************************************************
		/// <summary>
		/// 背景色の設定
		/// </summary>
		/// <param name="color">色</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetBackColor(const MofU32& color);
		// ********************************************************************************
		/// <summary>
		/// 枠線の色の設定
		/// </summary>
		/// <param name="color">色</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetLineColor(const MofU32& color);
		// ********************************************************************************
		/// <summary>
		/// テキストの表示色の設定
		/// </summary>
		/// <param name="color">色</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetTextColor(const MofU32& color);
		// ********************************************************************************
		/// <summary>
		/// 矩形取得
		/// </summary>
		/// <returns>矩形</returns>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		CRectangle GetRect(void) const;
		// ********************************************************************************
		/// <summary>
		/// マウスが重なっているかのフラグ取得
		/// </summary>
		/// <returns>マウスが重なっているか</returns>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		MofBool IsMouseOver(void) const;
		// ********************************************************************************
		/// <summary>
		/// マウス左ボタンで押した瞬間のフラグ取得
		/// </summary>
		/// <returns>マウス左ボタンで押した瞬間のフラグ</returns>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		MofBool IsPush(void) const;
		// ********************************************************************************
		/// <summary>
		/// マウス左ボタンで押されているかのフラグ取得
		/// </summary>
		/// <returns>マウス左ボタンで押されているかのフラグ</returns>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		MofBool IsHold(void) const;
		// ********************************************************************************
		/// <summary>
		/// マウス左ボタンが離れた瞬間のフラグ取得
		/// </summary>
		/// <returns>マウス左ボタンが離れた瞬間のフラグ</returns>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		MofBool IsPull(void) const;
		// ********************************************************************************
		/// <summary>
		/// 描画フラグの取得
		/// </summary>
		/// <returns>描画フラグ</returns>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		MofBool IsShow(void) const;
		// ********************************************************************************
		/// <summary>
		/// 座標の取得
		/// </summary>
		/// <returns>座標</returns>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		Vector2 GetPos(void) const;
		// ********************************************************************************
		/// <summary>
		/// サイズの取得
		/// </summary>
		/// <returns>サイズ</returns>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		Vector2 GetSize(void) const;
		// ********************************************************************************
		/// <summary>
		/// テキストの取得
		/// </summary>
		/// <returns>テキスト</returns>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		CString GetText(void) const;
		// ********************************************************************************
		/// <summary>
		/// フォントサイズの取得
		/// </summary>
		/// <returns>フォントサイズ</returns>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		MofS32 GetFontSize(void) const;
	};
}

