#pragma once
#include "Mof.h"
#include "Controll.h"

namespace ToolControll
{
	// ********************************************************************************
	/// <summary>
	/// ラベルクラス
	/// </summary>
	// ********************************************************************************
	class CLabel : public CControll
	{
	private:
		MofBool		m_bBackShow;			//!<背景表示フラグ
	public:
		// ********************************************************************************
		/// <summary>
		/// コンストラクタ
		/// </summary>
		/// <created>いのうえ,2020/02/25</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		CLabel(void);
		// ********************************************************************************
		/// <summary>
		/// デストラクタ
		/// </summary>
		/// <created>いのうえ,2020/02/25</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		virtual ~CLabel(void);
		// ********************************************************************************
		/// <summary>
		/// ラベルの生成
		/// </summary>
		/// <returns>ラベルポインタ</returns>
		/// <created>いのうえ,2020/02/25</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		static std::shared_ptr<CLabel> CreateLabel(void);
		// ********************************************************************************
		/// <summary>
		/// 描画
		/// </summary>
		/// <created>いのうえ,2020/02/24</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		virtual void Render(void) override;
		// ********************************************************************************
		/// <summary>
		/// 背景色描画フラグの設定
		/// </summary>
		/// <param name="b">フラグ</param>
		/// <created>いのうえ,2020/02/29</created>
		/// <changed>いのうえ,2020/02/29</changed>
		// ********************************************************************************
		void SetBackShow(const MofBool& b);
	};

	//置き換え
	typedef std::shared_ptr<CLabel> LPLabel;
}

